{
  "applicant": {
    "name": {
      "first": "Philip",
      "last": "Snyder"
    },
    "address": {
      "street1": "1116 Mockingbird Rd",
      "street2": "#1794",
      "city": "Wrightwood",
      "state": "CA",
      "postalCode": "92397"
    },
    "contactInfo": {
      "phone": "714-499-2405",
      "email": "prs.senior@gmail.com",
      "linkedIn": "https://www.linkedin.com/in/philiprsnyder",
      "stackOverflow": "https://stackoverflow.com/users/2175988/prs",
      "github": "https://github.com/psnyder",
      "bitbucket": "https://bitbucket.org/philipsnyder"
    }
  },
  "title": "Computer Scientist + Electronics Hobbyist + Artist = Your Unicorn",
  "intro": "Visionary Engineering Leader with 25+ years of experience designing and delivering complex, high-performance web applications and scalable data visualization platforms. Proven expertise in modern front-end technologies, including TypeScript, JavaScript, and React, with a focus on responsive design, cross-browser compatibility, and performance optimization. Adept at leading cross-functional teams, mentoring engineering colleagues, and fostering innovation to solve challenging problems. Skilled at driving platform-level transformations, building customer-centric solutions, and partnering with product management to deliver seamless user experiences. Passionate about cloud observability and leveraging cutting-edge technologies to elevate data visualization experiences and enable business success.",
  "experience": [
    {
      "employer": "UltiMaker",
      "startDate": "2023-11-01",
      "endDate": "2024-05-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Spearheaded integration of CloudPrint into UltiMaker ecosystem, bridging MakerBot's communication layer with Digital Factory software for seamless printer connectivity.",
        "Co-developed NeoPrep with cross-functional team, creating a versatile codebase for multi-platform deployment and cloud-based slicing capabilities.",
        "Analysed existing systems to devise efficient integration strategies, ensuring compatibility between MakerBot printers and UltiMaker's cloud services.",
        "Conceptualised and implemented software architectures facilitating smooth integration of diverse printer models into UltiMaker's ecosystem."
      ]
    },
    {
      "employer": "Makerbot",
      "startDate": "2020-10-01",
      "endDate": "2023-11-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Engineered cutting-edge spam filtering and content moderation systems, bolstering security for user-generated content and preventing S3 storage misuse.",
        "Swiftly addressed security risks following data leak discovery, implementing robust measures to safeguard user information.",
        "Revolutionised printer connectivity within cloud ecosystem. Designed highly efficient communication layer, enabling increased camera polling frequency without performance degradation.",
        "Developed print success tracking and progress reporting features, enhancing user experience and providing valuable insights into printer performance.",
        "Utilised DataDog for comprehensive performance tracking, identifying optimisation opportunities that improved printer efficiency and reduced operational costs."
      ]
    },
    {
      "employer": "Oportun",
      "startDate": "2018-10-01",
      "endDate": "2020-05-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Engineered cutting-edge tools to streamline development and QA processes, including a Chrome plugin for swift test data entry, enhancing team efficiency.",
        "Partnered with core IT and Security teams to implement robust PII encryption measures, ensuring data protection and system integrity.",
        "Lead internationalisation efforts for client applications, expanding service reach to Spanish-speaking customers and driving market growth."
      ]
    },
    {
      "employer": "Springboard Auto",
      "startDate": "2018-06-01",
      "endDate": "2018-10-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Conducted comprehensive software audit, creating detailed documentation and system diagrams. Enhanced transparency for seamless transition during acquisition.",
        "Designed and executed platform migration from Rackspace to AWS, delivering proof of concept in just 3 weeks. Streamlined operations for successful acquisition.",
        "Fostered cross-functional collaboration to prepare platform for acquisition. Coordinated with teams to align software, documentation, and migration efforts."
      ]
    },
    {
      "employer": "Springboard Auto",
      "startDate": "2016-06-01",
      "endDate": "2017-12-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Led API layer creation, mentored junior engineers, and pioneered code coverage and test data generation for comprehensive quality assurance. Engineered robust file encryption and compression system for sensitive document handling on Amazon S3. Maintained exceptional code coverage through rigorous test-driven development practices.",
        "Implemented diverse payment processing methods, ensuring secure transactions for multiple stakeholders. Developed reporting codebase generating and delivering CSV files to partners, driving traffic to Springboard Auto.",
        "Fostered team cohesion by mentoring colleagues and leading small developer groups. Contributed to building a comprehensive auto lending platform operational across numerous states."
      ]
    },
    {
      "employer": "Restoration Media",
      "startDate": "2015-08-01",
      "endDate": "2016-05-01",
      "title": "Senior Data Analyst",
      "bulletPoints": [
        "Analysed user activity data, processing 25 million records daily, to enhance email campaign targeting and improve company's email reputation score.",
        "Developed UI for querying large datasets using OpenNLP, enabling SQL query generation from natural language inputs based on mapped database schema.",
        "Deployed scalable enterprise application using AWS services, integrating PostgreSQL server to manage billions of records with sub-5-minute query times.",
        "Pioneered real-time user interaction mapping using Google Maps, providing visual insights into geographical engagement patterns."
      ]
    },
    {
      "employer": "Central Desktop",
      "startDate": "2008-02-01",
      "endDate": "2012-04-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Led development on API integrations, enhancing system connectivity and user experience.",
        "Migrated to TinyMCE editor, improving content management across multiple subdomains.",
        "Developed AJAX tree widget, boosting site functionality and user engagement.",
        "Implemented build processes for JavaScript/CSS, optimizing deployment efficiency.",
        "Added WebDAV support, streamlining file access and enhancing collaborative editing."
      ]
    },
    {
      "employer": "NextWave Wireless",
      "startDate": "2009-01-01",
      "endDate": "2010-01-01",
      "title": "Senior Applications Analyst",
      "bulletPoints": [
        "Implemented open-source SSO, enhancing security and accessibility for 500+ users.",
        "Developed admin site for Cisco MeetingPlace, aligning 200+ users with Active Directory.",
        "Created IT tools like backup scripts, improving system reliability and efficiency."
      ]
    },
    {
      "employer": "PriceGrabber",
      "startDate": "2008-01-01",
      "endDate": "2009-01-01",
      "title": "Senior Software Engineer",
      "bulletPoints": [
        "Led AJAX-based travel site redesign, enhancing user interaction and engagement.",
        "Developed OOP PHP library for seamless database-object integration.",
        "Engineered web reporting tool, optimizing marketing analytics.",
        "Created cross-browser JavaScript library for dynamic UI elements."
      ]
    },
    {
      "employer": "Gateway Computers",
      "startDate": "2008-01-01",
      "endDate": "2009-01-01",
      "title": "Software Engineer",
      "bulletPoints": [
        "Led a team of 8 in revamping Gateway's B2B portal with PHP5 and MySQL, enhancing user experience.",
        "Developed a dynamic tree view for custom computer configurations, boosting sales efficiency.",
        "Designed database architecture for the new portal, improving data management and accessibility.",
        "Created a database abstraction library, ensuring smooth transitions between MySQL and Oracle.",
        "Implemented an OOP object mapping framework, reducing development time through code reuse."
      ]
    },
    {
      "employer": "SQLFusion LLC",
      "startDate": "2008-01-01",
      "endDate": "2009-01-01",
      "title": "MySQL DBA",
      "bulletPoints": [
        "Maintained excellent customer relationships while meeting project requirements on a deadline.",
        "Optimised MySQL databases for multiple clients, achieving 99.999% uptime for a high-profile government project through strategic replication and memory-based table implementation."
      ]
    },
    {
      "employer": "Vizional Technologies",
      "startDate": "2000-09-01",
      "endDate": "2002-06-01",
      "title": "Web Developer",
      "bulletPoints": [
        "Engineered cutting-edge reporting tools, optimising warehouse space management for clients. Developed Java servlet-based portal with XML/XSL skinnable interface, enhancing supply chain visibility.",
        "Analysed client requirements to design and implement bespoke web solutions. Created robust tracking systems for shipments, improving supply chain efficiency and transparency."
      ]
    },
    {
      "employer": "Scour.com",
      "startDate": "2000-04-01",
      "endDate": "2000-09-01",
      "title": "Web Developer",
      "bulletPoints": [
        "Collaborated with a small team of engineers and designers, develop a music sharing portal, enhancing user engagement.",
        "Implemented a WebDAV interface in PHP for user file storage, improving accessibility. Enhanced online storage solutions, leading to increased user satisfaction."
      ]
    }
  ],
  "education": [
    {
      "degree": "Computer Science",
      "schoolName": "Indiana University / Purdue University @ Indianapolis (IUPUI)",
      "dateString": "1995 - 1997"
    },
    {
      "degree": "Computer Science & Studio Art",
      "schoolName": "Ball State University",
      "dateString": "1997 - 2000"
    }
  ],
  "interests": {

  },
  "references": {

  }
}
